Repository: Sque-ak/Pyglshell
Catalog: docs/locales/*/LC_MESSAGES/apireference.po
Languages: ru_ru

source: Classes
ru_ru: Классы

source: Classes serve as abstract structures of an object. For example, we have a class called ``Window``, and all objects of this class belong to the Window class. They have a main class, ``WindowManager``, which manages and composes these classes. This section will describe classes of this kind.
ru_ru: Классы выступают в роли абстрактных структур объекта. Например у нас есть класс ``Window``, все объекты этого класса, имеет класс ``Window``. У них есть основной класс ``WindowManager``, который управляет и компанует эти классы. В данном разделе будут описываться такого рода классы.

source: These abstract classes describe windows and a window manager, which is needed for managing and composing windows. Thanks to these classes, we can access the main window manager and retrieve all currently open windows.
ru_ru: Данные абстрактные классы, описывают окна и менеджер окон, он нужен для управления окнами, компоновки окон, благодаря этим классом мы можем обратиться в основной менеджер окон и получить все окона которые в данный момент открыты.

source: In the Window class, the methods ``run`` and ``on_init`` must be defined. They are necessary for initializing the window and executing specific actions or loops within it.
ru_ru: В классе ``Window``, обязательно должен быть описан метод ``run``, ``on_init``. Они нужны для инициализации окна и выполнения внутри него определенных действий, циклов.

source: In the WindowsManager, you also need to define the methods ``create_window`` and ``destroy_window`` for managing windows within the manager. This way, it's not necessary to create a new class and pass it to the WindowManager; you can directly create and initialize an object from within the WindowManager according to the manager's specifications.
ru_ru: В WindowsManager, дополнительно нужно задать метод ``create_window``, ``destroy_window``. Для реализации окон внутри менеджера. Таким образом нам не обязательно создавать новый класс, передавать его в WindowsManager, можно сразу из под WindowsManager'a создать объект про инициализировать его согласно менеджеру.

source: Abstract class, main structure for windows.
ru_ru: Абстрактный класс, основная структура для окон.

source: By default:
ru_ru: По-умолчанию:

source: Methods
ru_ru: Методы

source: ``get_manager():WindowManager`` - Returns the windows manager to which the current window belongs;
ru_ru: ``get_manager():WindowManager`` - Вернет родителский WindowsManager;

source: ``is_exist(window: Window):bool`` - Checks if the window exists in the current window;
ru_ru: ``is_exist(window: Window):bool`` - Проверяет, действительно ли существует указанное окно, в его дочерних элементах;

source: ``is_windows_manager():bool`` - Checks if the current window is a windows manager, by default equals False;
ru_ru: ``is_windows_manager():bool`` - Проверяет является ли это окно WindowsManager'ом, по умолчанию Ложь;

source: ``is_composite():bool`` - Checks if the current window is composite, by default equals False;
ru_ru: ``is_composite():bool`` - Провереяет, является ли это окно, компоновщиком, по-умолчанию вернет False;

source: ``set_nonexistant_name(window: Window, index = 1):Window`` - Sets a unique name for the window if the current name already exists. Return the window with new name.
ru_ru: ``set_nonexistant_name(window: Window, index = 1):Window`` - Установит уникально наименование окну, и вернет это окно.

source: ``add(window: Window):None`` - Adds a window to the collection, ensuring it has a unique name. Sets the parent of the added window to the current window.
ru_ru: ``add(window: Window):None`` - Добавит в компоновщик, окно и станет его родителем. В случае если внутри него уже есть такое окно, присвоит ему уникальное имя.

source: ``remove(window: Window):None`` - Removes a specified window from the collection. If the window is found, it is deleted from the collection.
ru_ru: ``remove(window: Window):None`` - Удалит окно из компоновщика

source: ``get(name:str):Window`` - Retrieves a window by its name from the collection. If not found, the method attempts to retrieve it from child windows recursively.
ru_ru: ``get(name:str):Window`` - Возвращяает окно по именни, ищет внутри дочерних окон;

source: Abstract Methods
ru_ru: Абстрактные методы

source: ``on_init():None`` - This method is needed for initializing windows, such as certain parameters.
ru_ru: ``on_init():None`` - Этот метод необходим для инициализации окон;

source: Why can't parameters be initialized in ``__init__()``?
ru_ru: Почему не подходит инициализация в конструкторе ``__init__()``?

source: For example, we want to obtain the window manager during initialization, but we created the object manually rather than through the windows manager. In this case, the `get_manager()` method is called during initialization, which refers to the parent and doesn't find the manager, resulting in self. To avoid this, we can first create the object, assign it to a specific window manager, and then initialize it.
ru_ru: К примеру мы хотим получить менеджер окон в инициализации, но мы создали объект не из под менеджера окон, а вручную, и вот в инициализации вызывается метод `get_manager()` он обращается к `parent` и не находит менеджер получает `self`. Чтобы такое избежать, мы можем сперва создать объект, присвоить его к определенному менджеру окон, после чего инициализировать.

source: ``run():None`` - This method is needed for performing certain actions, and the manager can call it in a loop.
ru_ru: ``run():None`` - Данный метод, необходим для выполнения каких либо действий, и может быть использован в цикле.

source: Properties
ru_ru: Параметры

source: ``name:str`` - The name of the window;
ru_ru: ``name:str`` - Наименование окна;

source: ``parent:Window`` - The parent of the window.;
ru_ru: ``parent:Window`` - Родитель окна;

source: ``_parent:Window`` - The name of the window;
ru_ru: ``_parent:Window`` - Родитель окна;

source: ``_name:str`` - The name of the window;
ru_ru: ``_name:str`` - Наименование окна;

source: ``_children: Dict[Window]`` - The children windows;
ru_ru: ``_children: Dict[Window]`` - Дочерние элементы окна;

source: Abstract class, main structure for Windows Manager, composing window. The class inherits from the ``Window`` class.
ru_ru: Абстрактный класс, структура для менеджера, компоновщика окон. наследуется от класса ``Window``.

source: extends: :ref:`RST Window`
ru_ru: Наследует: :ref:`RST Window`

source: ``create_window(name:str):Window`` - Creates a new window with the specified name.
ru_ru: ``create_window(name:str):Window`` - Создает новое окно.

source: ``destroy_window(name:str):None`` - Destroys the window with the specified name.
ru_ru: ``destroy_window(name:str):None`` - Уничтожает окно.
